> > Yesterday and today we tried to deploy an ECS service on GovCloud and it failed with the following message: `- InvalidParameterException: Only Standard log class is supported.`
> > Prior to fail creating the service the following message was printed about the CloudWatch:
> > ```
> > # module.xxx-xxx-xxx.aws_cloudwatch_log_group.log-group will be created
> >   + resource "aws_cloudwatch_log_group" "log-group" {
> >       + arn               = (known after apply)
> >       + id                = (known after apply)
> >       + log_group_class   = "STANDARD"
> >       + name              = "/ecs/xxxx-xxxx-xxxx"
> >       + name_prefix       = (known after apply)
> >       + retention_in_days = 0
> >       + skip_destroy      = false
> > ```
> > 
> > 
> >     
> >       
> >     
> > 
> >       
> >     
> > 
> >     
> >   
> > I'm confused, should it be `Standard` or `Computed`?
> 
> i am still seeing this as well

We implemented a workaround for this bug. We hardcoded the Terraform version under the required_provider section. The last known stable version was 5.26.0:
```
  required_providers {
    aws = {
      source = "hashicorp/aws"
      version = "5.26.0"
    }
```
Version 5.30.0 is still failing.